Repository: mohammed-khateeb/munch
Catalog: lib/l10n/app_*.arb
Languages: ar

# errorLabel
source: Error
ar: خطأ

# okLabel
source: OK
ar: موافق

# fillAll
source: Please fill all fields
ar: الرجاء تعبئة كافة المعلومات

# unknownError
source: Unknown error occurred
ar: خطأ غير معروف

# successfullTitle
source: Successful
ar: نجاح

# sentEmail
source: Your email was sent successfully
ar: تم ارسال البريد الالكتروني بنجاح

# noInternet
source: No internet connection!
ar: تعذر الاتصال بالانترنت!

source: Cancel
ar: الغاء

# loadingLabel
source: Loading...
ar: تحميل...

source: Products
ar: المنتجات

source: Hello
ar: مرحبا

source: SAR
ar: ر.س

source: Orders
ar: الطلبات

# munchBunch
source: Save Very Munch
ar: وفر مع منش

# more
source: Menu
ar: القائمة

source: Recommended For You
ar: مقترحة لك

source: Buy Now
ar: اشتر الآن

source: Order
ar: الطلب

source: Items
ar: منتج

source: Order Now!
ar: اطلب الآن!

source: See all
ar: رؤية الكل

source: Your order (pick up)
ar: طلبك (استلام)

source: Your order (Delivery)
ar: طلبك (توصيل)

source: Locate Me
ar: موقعي

source: OR
ar: أو

source: Choose city
ar: اختر المدينة

# selectLocationErrorTxt
source: Choose location please
ar: الرجاء اختيار موقع

source: when?
ar: متى؟

# iWantNow
source: I want it now
ar: أريده الآن

source: I want reservation
ar: أريد حجز

source: Choose Date
ar: إختر التاريخ

# timeSlotsHeader
source: Time slots available for date picked
ar: الأوقات المتاحة للتاريخ المحدد

source: Confirm
ar: تأكيد

# youWant
source: You want product as soon as possible?
ar: تريد المنتج بأقرب وقت؟

# clickHere
source: Click here to go back
ar: اضغط هنا للرجوع

# chooseDistrict
source: Choose your district
ar: اختر منطقتك

source: My Account
ar: حسابي

source: My Addresses
ar: عناويني

source: Store Locations
ar: مواقع الفروع

source: About Us
ar: من نحن

source: Contact Us
ar: تواصل معنا

# changeLang
source: العربية
ar: English

source: Login
ar: تسجيل الدخول

source: Add To Cart
ar: أضف إلى العربة

source: How many?
ar: كم العدد؟

source: Related items
ar: السلع المشابهة

source: Your cart
ar: سلتك

source: Price
ar: السعر

source: Quantity
ar: الكمية

source: Delete
ar: حذف

source: Proceed to checkout
ar: الإستمرار في الشراء

# customersWhoBought
source: You may also like
ar: ربما يعجبك هذا أيضاً

source: Payment details
ar: تفاصيل الدفع

source: Order total
ar: قيمة المنتجات

source: Discount
ar: الخصم

# delFees
source: Delivery fees
ar: رسوم التوصيل

source: Total
ar: المجموع

source: Place order
ar: اطلب

source: Order details
ar: تفاصيل الطلب

source: Payment option
ar: خيار الدفع

source: Change
ar: تغيير

source: cash on delivery
ar: دفع عند التوصيل

# onlinePayment
source: Credit card / mada bank Card
ar: بطاقة ائتمان / بطاقة مدى البنكية

# howPick
source: How you want to pickup this order?
ar: كيف تريد ان تستلم الطلب؟

source: Delivery
ar: التوصيل

source: Store pickup
ar: استلام من المركز

source: Coupon code?
ar: رمز الكوبون؟

# descOfLoc
source: Description of location
ar: وصف العنوان

source: Save for later
ar: حفظ لما بعد

# nameOfLoc
source: Name of location
ar: اسم العنوان

# nameOfLocRequired
source: Name of location required
ar: يرجى إدخال اسم العنوان

source: Add
ar: إضافة

# addYourCoupon
source: add your coupon here
ar: أضف الكوبون الخاص بك هنا

source: Enter code here
ar: أدخل الرمز هنا

source: Close this
ar: أغلق هذا

# buySomething
source: You need to buy something
ar: يجب عليك ان تشتري شيئا

source: View previous orders
ar: عرض الطلبات السابقه

# andBuy
source: and buy something
ar: و اشتري شيئا

# allIsGood
source: All is good, your order is recieved
ar: كل شئ تمام، تم استلام طلبك

source: Order status
ar: حالة الطلب

source: Order summary
ar: ملخص الطلب

source: Approved
ar: مقبول

source: Rejected
ar: مرفوض

# findOut
source: Find out why?
ar: اعرف السبب؟

source: Pay by cash
ar: الدفع نقدا

source: Pay by card
ar: الدفع عن طريق البطاقه

# payByMunch
source: Pay by munch bunch
ar: الدفع عن طريق منش بنش

# vat
source: All prices are VAT inclusive
ar: جميع الأسعار شاملة ضريبة القيمة المضافة

# messageFrom
source: Message from branch manager:
ar: رسالة من مدير الفرع:

source: Previous orders
ar: الطلبات السابقة

source: View items ordered
ar: عرض السلع المطلوبة

source: Order again
ar: إعادة الطلب

source: Next tier
ar: الدرجه التاليه

source: View Transaction
ar: عرض العمليات

# ptsToExpire
source: Expired points
ar: النقاط التي ستنتهي صلاحيتها

source: Redeem points
ar: استبدال النقاط

# forInStore
source: For in-store redumption
ar: للإستبدال بالمتجر

# welcomeBack
source: Login / Register
ar: التسجيل / تسجيل الدخول

source: Edit profile
ar: تعديل الملف

# startChat
source: Start live chat with our support
ar: ابدأ محادثه مباشره مع موظفي الدعم

source: Name
ar: الإسم

# email
source: Email Address
ar: البريد الإلكتروني

# phone
source: Phone Number
ar: رقم الهاتف

source: Submit
ar: تنفيذ

# howDidIt
source: How did it all start?
ar: كيف بدأ كل شئ

source: Company profile
ar: ملف الشركة

# register
source: New User
ar: مستخدم جديد

# emailOrMobile
source: Email/ Mobile ex. 0512345678
ar: البريد الالكتروني / الجوال مثال 0512345678

source: Password
ar: كلمة المرور

# forgetPassword
source: Forgot Password?
ar: نسيت كلمة المرور؟

source: Remember me?
ar: تذكرني؟

source: Repeat password
ar: اعادة كلمة المرور

source: Added Successfully
ar: تمت الإضافة بنجاح

# outOfStock
source: This item is out of stock
ar: هذا المنتج غير متوفر حاليا

# firstName
source: Full Name
ar: الاسم الكامل

source: Last Name
ar: الاسم الاخير

# wrongCredenials
source: Your password or Mobile/Email is incorrect
ar: بريدك الالكتروني او رقم الهاتف او كلمة المرور غير صحيحة

source: Logout
ar: تسجيل الخروج

# noCart
source: No items in your cart
ar: لا يوجد منتجات في سلتك

# notAvailable
source: Not available in this store, select another store or delete this item from your cart.
ar: غير متوفر في هذا المتجر، اختر متجر آخر او احذف هذا المنتج من سلتك

# notAllAvailable
source: Not all items available in this store, please check your cart.
ar: ليست كل منتجاتك متوفره في هذا المتجر، الرجاء تفقد سلتك

# notAllAvailableDelivery
source: Not all items available, please check your cart.
ar: ليست كل منتجاتك متوفره، الرجاء تفقد سلتك

source: Revoke
ar: إلغاء

source: Invalid coupon
ar: كوبون غير فعال

# choosePickupMethod
source: Please choose pickup method
ar: الرجاء اختيار طريقة التوصيل

source: Email or mobile already exist
ar: البريد الالكتروني او رقم الهاتف مستخدمان مسبقا

# waitingBranchConfirmation
source: Waiting for branch confirmation
ar: بإنتظار تأكيد الفرع

source: Accepted
ar: مقبول

source: Cancelled
ar: ملغى

source: On the Way
ar: جاري توصيل طلبك

source: Ready for Picked Up
ar: جاهز للإستلام

source: Delivered
ar: تم التوصيل

source: Picked Up
ar: تم الإستلام

source: Change password
ar: تغيير كلمة المرور

source: Save
ar: حفظ

# addAddress
source: Add new address
ar: اضافة عنوان جديد

# locName
source: Location name
ar: اسم الموقع

source: Enter amount here
ar: أدخل الكميه هنا

source: Time slots
ar: الاوقات المتاحه

source: Points
ar: النقاط

# chooseAddress
source: Please choose address
ar: الرجاء اختيار العنوان

source: Already Back?
ar: عدت مجددا؟

source: Closest location
ar: الموقع الأقرب

source: Order from here
ar: اطلب من هنا

source: Directions
ar: الاتجاهات

source: Sent successfully
ar: تم الإرسال بنجاح

# alreadyBackDetails
source: We knew that you gonna love munch products, Welcome again! pick your previuosly saved locations or add a new one
ar: نحن نعلم أنك ستحب المنتجات المتنوعة ، مرحبًا مرة أخرى! اختر مواقعك المحفوظة مسبقًا أو أضف موقعًا جديدًا

# chooseTime
source: Please choose time
ar: الرجاء اختيار الوقت

source: Search for products
ar: ابحث في المنتجات

# notCovered
source: Sorry, Your location is not covered
ar: نعتذر، موقعك ليس مغطى

# orderLoc
source: Order Location
ar: موقع الطلب

# sureClose
source: Are you sure that you want to close this page?
ar: هل انت متأكد انك تريد إغلاق هذه الصفحة؟

source: YES
ar: نعم

source: NO
ar: لا

# outOfStockTemp
source: Out of stock temporary
ar: نفذ من المخزون مؤقتاً

source: (Not all items available)
ar: (ليست كل منتجاتك متوفره)

# notAvailableDelivery
source: Delivery is not available
ar: التوصيل غير متوفر

# notAvailableStorePickup
source: Store pickup is not available
ar: الاستلام من المركز غير متوفر

# allIsGoodPayment
source: All is good, your payment was proceeded successfully
ar: كل شئ تمام، تمت عملية الدفع بنجاح

source: Payment Failed
ar: لم تتم عملية الدفع بنجاح

source: Warning
ar: تحذير

source: Choose
ar: اختر

# numberValidation
source: There was a problem, Please enter a valid mobile number
ar: هناك خطأ، أدخل رقم هاتف صحيح

# minimumOrderError
source: The minimum amount for delivery order is 50 SAR, please add additional products or you can select the option to pickup from one of our branches
ar: الحد الأدنى لطلبات التوصيل هو 50 ريال ، يرجى إضافة المزيد من المنتجات أو يمكنك تحديد خيار الاستلام من أحد فروعنا

source: Try Again
ar: حاول مره اخرى

# emailOrMobileEnter
source: Enter your email or mobile number and password
ar: أدخل بريدك الإلكتروني أو رقم الهاتف وكلمة السر

# forgetPasswordHeader
source: Enter the email address or mobile number associated with your Munch Bakery account
ar: يُرجى إدخال البريد الإلكتروني أو رقم الهاتف المقترن بحسابك في منش بيكري

# registerBtn
source: Register
ar: سجل

source: Browse Products
ar: تصفح المنتجات

# byCreatingAccount
source: By creating an account, you agree to Munch Bakery's Conditions of Use
ar: عند انشاء حساب، انت توافق على الشروط والأحكام لاستخدام موقع منش بيكري

source: Order Notes
ar: ملاحظات الطلب

# whatsapp
source: Start WhatsApp chat with our support
ar: تواصل معنا عن طريق الوتساب

# emailMobileAlreadyExist
source: Mobile number or Email already in use
ar: رقم الهاتف أو الإيميل مستخدم بالفعل

# existingCustomer
source: Are you an existing customer?
ar: هل أنت عميل موجود؟

source: Sign-In
ar: تسجيل الدخول

# paymentTryAgain
source: There was a problem processing the payment, Please try again
ar: هناك خطأ في عملية الدفع، حاول مرة أخرى

# minPoints
source: Minimum amount to redeem is 5000 point
ar: الحد الادنى لاستبدال النقاط هو ٥٠٠٠ نقطة

# getNewPassword
source: Get new password by sms
ar: احصل على كلمة مرور جديدة برسالة نصية

# emailOptional
source: Email Address (Optional)
ar: البريد الإلكتروني (اختياري)

# locationPermissionTxtHeader
source: Location Permission
ar: الموقع

# locationPermissionTxt
source: Location is required to help you in adding your address in the application
ar: الموقع مطلوب لتحديد عنوانك

# paymentFailedDetails
source: For customized cakes, the order should be paid 48 hours before the pickup date
ar: لطلبات تصميم الكيك يجب دفع المبلغ قبل موعد الاستلام ب ٤٨ ساعة

source: Pay Cash
ar: ادفع نقدا

source: Add Photo On Cake
ar: طباعة صورة على الكيكة

source: Take Photo
ar: إلتقط صورة

source: Photo Library
ar: معرض الصور

# updateAvailable
source: For better experience, Update now
ar: لتجربة أفضل، حدث الآن

# update
source: Update now
ar: حدث الآن

# carDelivered
source: Deliver to my car
ar: توصيل الى سيارتي

source: Add Notes
ar: أضف ملاحظات

# onceArrived
source: Once arrived please click the below button sothat our sales team deliver the order to your car
ar: عند الوصول نرجو الضغط على 'وصلت الان' حتى يقوم فريق المبيعات لدينا بتسليم الطلب إلى سيارتك

# selectToDeliver
source: Select this option to deliver the order to your car
ar: يرجى اختيار الخيار التالي لتسليم الطلب لسيارتك

source: I've Arrived
ar: لقد وصلت

source: Car Description
ar: وصف السيارة

# successCurb
source: Thank you. Our sales team will prepare the order and deliver it to your car.
ar: شكرا لك استرح في سيارتك وسيقوم فريق المبيعات بتسليمك الطلب

# infoAddPhoto
source: This service cost is 40 SAR
ar: تتيح هذة الخدمة طباعة صورة على الكيكة وتكلفتها ٤٠ ريال سعودي

# confirmDate
source: Confirm
ar: موافق

source: Search for places
ar: بحث عن المواقع

# giftsSoon
source: Gifts are coming soon
ar: الهدايا ستأتي لاحقا

source: History of gifts
ar: أرشيف الهدايا

# hereAreGifts
source: Here are your gift cards
ar: ها هي بطاقات هداياك

source: Copy
ar: نسخ

source: Active gift cards
ar: بطاقات الهدايا الفعالة

source: Customized Cake
ar: كيك حسب الطلب

# makeOwnCake
source: Make your own cake
ar: اصنع كيكتك الخاصة

# makeOwnCakeDetails
source: Make your own cake
ar: صمم الكيكة الخاصة بك

source: Start Making
ar: ابدأ الصنع

source: Sort By:
ar: الترتيب حسب:

source: Sub Total
ar: قيمة المنتجات

source: Basic
ar: أساسي

source: Advanced
ar: متقدم

source: Upload your image
ar: تحميل صورة

source: Browse your gallery
ar: تصفح معرض الصور

source: Size of your cake
ar: اختر حجم الكيكة

source: Choose size
ar: اختر الحجم

source: First half
ar: النصف الأول

source: Second half
ar: النصف الثاني

source: Cake description
ar: وصف الكيكة

# cakeMessage
source: Cake message or text
ar: الكتابة على الكيك

# cakeDetails
source: Cake price details
ar: تفاصيل سعر الكيكه

source: Browse Gallery
ar: تصفح معرض الصور

source: All cakes
ar: كل الكيك

source: Show all filters
ar: عرض كل الفلاتر

source: Color
ar: اللون

source: Choose color
ar: اختر اللون

source: Size
ar: الحجم

source: Price range
ar: حدود السعر

source: Choose price range
ar: اختر مجال السعر

source: Filter results
ar: نتائج الفلتر

source: Edit
ar: تعديل

# munchCakeDescPlaceholder
source: Enter a short explanation what do you want us to do with your cake
ar: اشرح تفاصيل أكثر نأخذها بعين الإعتبار عند تزيين الكيكة(مثلا الوان الكيك او لون القاعدة .. الخ)

# munchCakeMessagePlaceholder
source: Enter exact text to be written on the cake
ar: اكتب تفاصيل الرسالة المطلوب كتابتها على الكيك

# cartAlreadyFilledWarning
source: You already started customizing a cake. Do you want to continue or create new one?
ar: لقد بدأت مسبقا صناعة كيكة هل تريد الإستمرار ام صناعة كيكة جديدة؟

# continueTxt
source: Continue
ar: استمرار

source: Create new one
ar: صناعة كيكة جديدة

# sizeRequired
source: Please choose size
ar: الرجاء اختيار الحجم

# imagesRequired
source: Please choose at least one image
ar: الرجاء اختيار صورة واحدة على الأقل

# cakeDescriptionRequired
source: Please fill cake description
ar: الرجاء تعبئة وصف الكيكة

# flavorsRequired
source: Please choose all flavors
ar: الرجاء اختيار كل النكهات

# whatGonna
source: What we gonna do today?
ar: ماذا سنفعل معاً اليوم؟

source: Order fresh products
ar: منتجات جاهزة

source: Order custom cake
ar: كيكة حسب الطلب

source: New location
ar: موقع جديد

source: Done
ar: تم

# continueDesign
source: Continue with this design
ar: اختيار هذه الصورة

source: Message
ar: الرسالة

source: Reset filter
ar: تفريغ الفلتر

source: Flavors
ar: النكهات

# allUploads
source: All uploaded images will be reviewed by customer service for the final price,
ar: جميع الصور المرفقة سيتم مراجعتها من قبل خدمة العملاء لتحديد السعر النهائي

# pricesMay
source: Prices may vary based on design and characters
ar: قد تختلف الاسعار حسب شكل التصميم وعدد الشخصيات

# contactMunchCake
source: If you have any questions chat with us
ar: للاستفسارات يمكنك التواصل معنا عبر الدردشة الفورية

# clickHereContact
source: Click here to contact us
ar: اضغط هنا للتواصل معنا

source: Starting from
ar: تبدأ من

# pickSize
source: Pick your size
ar: اختر الحجم

source: Change Address
ar: تغيير العنوان

source: Something went wrong
ar: حدث خطأ

source: Win with Munch
ar: اربح مع Munch

source: SPIN THE WHEEL
ar: دور العجلة

source: Go to save very Munch
ar: اذهب الى وفّر مع منش

# mobileEnter
source: Enter your mobile number
ar: ادخل رقم الهاتف

# mobilePassEnter
source: Enter your mobile number and password
ar: ادخل رقم الهاتف وكلمة المرور

source: Free
ar: مجانا

source: Terms
ar: الشروط

# hereGifts
source: Here you can find actual active offers and discount codes
ar: هنا يمكنك ان تجد عروض فعاله حقيقيه وكودات الخصومات

source: Redeem Now
ar: استبدل الأن

source: All
ar: الكل

source: Offers
ar: العروض

source: Packages
ar: الحزم

source: Add new address
ar: إضافة عنوان جديد

# searchPlaceHolder
source: Search
ar: بحث

source: Choose Store
ar: اختر المتجر

source: Discount Cards
ar: بطاقات الخصم

# smsSent
source: A text message has been sent with the Password to your mobile If you didn’t receive the password, You can try to get another password after 30 seconds
ar: تم ارسال رسالة نصيه الى رقم هاتفك ان لم تستلم كلمة مرور بإمكانك طلب كلمة مرور جديدة بعد ٣٠ ثانية

source: Choose payment method
ar: اختر طريقة الدفع

# termsAgreed
source: I have read and agreed the terms and conditions
ar: لقد قرأت ووافقت على الشروط والأحكام

# termsAgreedRequired
source: You must agree on the terms and conditions
ar: يجب عليك الموافقة على الشروط والأحكام

# chatWithUs
source: Chat with us if you have any questions
ar: تواصل معنا اذا لديك اي استفسارات

# clickCurbside
source: Click here to recieve your order to curbside
ar: اضغط هنا لتستلم طلبك في السيارة

source: Recieved
ar: تم استلامه

# finalReceipt
source: Final receipt will be shared. Changes may occur
ar: سيتم ارسال الفاتورة النهائية .من الممكن حدوث تغييرات

# smsPaymentMethod
source: Payment link via SMS
ar: رابط للدفع عبر رسالة نصية

# getPaymentLink
source: Get payment link via SMS
ar: احصل على رابط للدفع عبر رسالة نصية

source: Thank you very munch!
ar: شكرا لك!

# copied
source: Copied To Clipboard
ar: تم النسخ

# welcomeBackProfile
source: Welcome back
ar: اهلا مجددا

source: Delete Account
ar: حذف الحساب
